month = ["январь", "февраль", "март", "апрель", "май", "июнь", "июль", "август", "сентябрь", "октябрь", "ноябрь",
         "декабрь"]
seson = ["зима", "весна", "лето", "осень", "зима"]
m = int(input(" Введите номер месяца в году: ")) - 1
while m < 0 or m > 11:
    print("Такого месяца в году не существует")
    m = int(input(" Введите номер месяца в году: ")) - 1
# Через list
print(f' {month[m]} соответствует сезону {seson[(m + 1) // 3]}')

# Через dict
month_dict = {0: "зима", 1: "зима", 11: "зима",
              2: "весна", 3: "весна", 4: "весна",
              5: "лето", 6: "лето", 7: "лето",
              8: "осень", 9: "осень", 10: "осень"}
print(f' {month[m]} соответствует сезону {month_dict.get(m)}')
